# DockablePaneId Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePaneId Class
Members See Also
---
Identifier for a pane that participates in the Revit docking window system.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class DockablePaneId : GuidEnum
```

Visual Basic
---
```text
Public Class DockablePaneId _
	Inherits GuidEnum
```

Visual C++
---
```text
public ref class DockablePaneId : public GuidEnum
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..GuidEnum Autodesk.Revit.UI..::..DockablePaneId
# See Also
DockablePaneId Members
Autodesk.Revit.UI Namespace